1314mjf521/ESP8266/ESP8266/src/main.cpp
 // MQTT控制启用标志 / MQTT control enable flag
 bool mqttControlEnabled = true; // 默认启用MQTT控制 / Default to enabled
 
 // MQTT重连函数 / MQTT reconnect function
 void reconnectMQTT() {
   if (!mqttControlEnabled) {
     return; // 如果禁用MQTT控制，则不进行检测 / Do nothing if MQTT control is disabled
   }
 
   if (client.connected()) return; // 如果已连接，直接返回 / Return if already connected
 
   unsigned long now = millis();
   if (!controllerOnline) {
     // 限制串口输出频率 / Limit serial output frequency
     if (now - lastControllerCheckTime >= controllerCheckInterval) {
       lastControllerCheckTime = now; // 更新上次检测时间戳 / Update last check timestamp
       Serial.println("控制端未上线，跳过MQTT连接 / Controller not online, skipping MQTT connection");
     }
     return;
   }
 
   if (now - lastMQTTReconnectAttempt >= mqttReconnectInterval) {
     lastMQTTReconnectAttempt = now; // 更新上次尝试时间戳 / Update last attempt timestamp
     Serial.print("尝试连接MQTT服务器... / Attempting to connect to MQTT server...");
     if (client.connect("ESP8266Client")) {
       Serial.println("连接成功 / Connected");
       client.subscribe(mqtt_topic_motor_control); // 订阅电机控制主题 / Subscribe to motor control topic
     } else {
       Serial.print("连接失败，状态码= / Connection failed, state=");
       Serial.println(client.state());
     }
   }
 }
 
 // 嵌入的HTML内容 / Embedded HTML content
 const char MAIN_HTML[] PROGMEM = R"rawliteral(
 <!DOCTYPE html>
 <html>
 <head>
   <meta charset="UTF-8">
   <title>ESP8266 步进电机控制系统</title>
   <style>
     body { font-family: Arial, sans-serif; text-align: center; margin: 20px; }
     h1 { color: #333; }
     button, input[type="text"], input[type="number"] { padding: 10px 20px; margin: 10px; font-size: 16px; }
     button { background-color: #4CAF50; color: white; border: none; cursor: pointer; }
     button:hover { background-color: #45a049; }
     input[type="text"], input[type="number"] { width: 300px; }
     .info { margin: 20px; font-size: 18px; }
     .button-group { margin: 20px; }
   </style>
   <script>
     // 加载设备信息 / Load device information
     function loadDeviceInfo() {
       fetch('/api/device_info')
         .then(response => response.json())
         .then(data => {
           document.getElementById('ipAddress').innerText = data.ip;
           document.getElementById('macAddress').innerText = data.mac;
           document.getElementById('version').innerText = data.version;
           document.getElementById('onlineClients').innerText = data.onlineClients;
         })
         .catch(() => alert('无法加载设备信息 / Failed to load device information'));
     }
 
     // 设置电机启动时长 / Set motor run duration
     function setMotorDuration() {
       const duration = document.getElementById('motorDuration').value;
       fetch(`/api/set_motor_duration?duration=${duration}`)
         .then(response => {
           if (response.ok) {
             alert('电机启动时长已更新！ / Motor run duration updated!');
           } else {
             alert('设置失败，请检查输入值 / Failed to set duration, please check the input value');
           }
         })
         .catch(() => alert('无法连接到设备 / Unable to connect to the device'));
     }
 
     // 设置MQTT地址 / Set MQTT address
     function setMQTTAddress() {
       const address = document.getElementById('mqttAddress').value;
       fetch(`/api/set_mqtt?address=${encodeURIComponent(address)}`)
         .then(response => {
           if (response.ok) {
             alert('MQTT地址已更新！ / MQTT address updated!');
           } else {
             alert('设置失败，请检查输入值 / Failed to set MQTT address, please check the input value');
           }
         })
         .catch(() => alert('无法连接到设备 / Unable to connect to the device'));
     }
 
     // 切换MQTT控制 / Toggle MQTT control
     function toggleMQTTControl(enable) {
       const url = `/api/mqtt_control?enable=${enable}`;
       fetch(url)
         .then(response => {
           if (response.ok) {
             alert(enable ? 'MQTT控制已启用！' : 'MQTT控制已禁用！');
           } else {
             alert('操作失败，请检查设备状态 / Operation failed, please check device status');
           }
         })
         .catch(() => alert('无法连接到设备 / Unable to connect to the device'));
     }
 
     // 重新进入配网模式 / Reset WiFi configuration
     function resetWiFi() {
       fetch('/api/reset_wifi')
         .then(response => {
           if (response.ok) {
             alert('设备正在重新进入配网模式 / Device is restarting to enter configuration mode');
           } else {
             alert('操作失败，请检查设备状态 / Operation failed, please check device status');
           }
         })
         .catch(() => alert('无法连接到设备 / Unable to connect to the device'));
     }
 
     window.onload = loadDeviceInfo;
   </script>
 </head>
 <body>
   <h1>ESP8266 步进电机控制系统</h1>
   <div class="info">
     <p>设备IP地址: <strong id="ipAddress"></strong></p>
     <p>设备MAC地址: <strong id="macAddress"></strong></p>
     <p>固件版本: <strong id="version"></strong></p>
     <p>在线控制端数量: <strong id="onlineClients"></strong></p>
     <button onclick="location.href='/clients'">查看控制端信息</button>
   </div>
   <div class="button-group">
     <h2>电机控制</h2>
     <button onclick="fetch('/motor/on').then(() => alert('电机已开启！')).catch(() => alert('操作失败！'));">开启电机</button>
     <button onclick="fetch('/motor/off').then(() => alert('电机已关闭！')).catch(() => alert('操作失败！'));">关闭电机</button>
     <button onclick="fetch('/motor/direction').then(() => alert('电机方向已切换！')).catch(() => alert('操作失败！'));">切换电机方向</button>
   </div>
   <div class="button-group">
     <h2>设置电机启动时长</h2>
     <input type="number" id="motorDuration" placeholder="输入时长（秒）" min="1" max="1800" required>
     <button onclick="setMotorDuration()">设置时长</button>
   </div>
   <div class="button-group">
     <h2>设置 MQTT 地址</h2>
     <input type="text" id="mqttAddress" placeholder="输入MQTT服务器地址" required>
     <button onclick="setMQTTAddress()">更新地址</button>
   </div>
   <div class="button-group">
     <h2>MQTT 控制</h2>
     <button onclick="toggleMQTTControl(true)">启用 MQTT 控制</button>
     <button onclick="toggleMQTTControl(false)">禁用 MQTT 控制</button>
   </div>
   <div class="button-group">
     <h2>OTA 升级</h2>
     <button onclick="location.href='/ota'">开始OTA升级</button>
   </div>
   <div class="button-group">
     <h2>WiFi 配置</h2>
     <button onclick="resetWiFi()">重新进入配网模式</button>
   </div>
 </body>
 </html>
 )rawliteral";
 
 // 获取当前时间戳（毫秒） / Get current timestamp (milliseconds)
 unsigned long getTimestamp() {
   return millis();
 }
 
 // 更新电机活动时间戳 / Update motor activity timestamp
 void updateMotorActivity() {
   lastMotorActivityTime = millis();
   Serial.printf("[%lu] 电机活动时间已更新 / Motor activity timestamp updated\n", lastMotorActivityTime);
 }
 
 // 检查电机未使用超时 / Check motor inactivity timeout
 void checkMotorInactivity() {
   if (motorEnabled && (millis() - lastMotorActivityTime >= motorInactivityTimeout)) {
     motorEnabled = false;
     digitalWrite(ENABLE_PIN, HIGH); // 禁用电机 / Disable motor
     Serial.printf("[%lu] 电机因未使用超时已禁用 / Motor disabled due to inactivity timeout\n", millis());
   }
 }
 
 // 初始化WiFi连接 / Initialize WiFi connection with fault tolerance
 void initializeWiFi() {
   WiFiManager wifiManager;
   wifiManager.setTimeout(180); // 设置智能配网超时时间为180秒 / Set smart configuration timeout to 180 seconds
 
   while (wifiConnectFailures < 3) {
     if (wifiManager.autoConnect("ESP8266_SmartConfig")) { // 设置配网热点名称 / Set WiFi configuration hotspot name
       Serial.println("WiFi连接成功 / WiFi connected");
       Serial.print("设备IP地址: / Device IP Address: ");
       Serial.println(WiFi.localIP());
       return;
     } else {
       wifiConnectFailures++;
       Serial.printf("WiFi连接失败，第%d次尝试 / WiFi connection failed, attempt %d\n", wifiConnectFailures, wifiConnectFailures);
       delay(10000); // 每次失败后等待10秒 / Wait 10 seconds after each failure
     }
   }
 
   // 超过3次失败后重新进入智能配网模式 / Enter smart configuration mode after 3 failures
   Serial.println("WiFi连接失败超过3次，进入智能配网模式 / WiFi connection failed more than 3 times, entering smart configuration mode");
   wifiManager.startConfigPortal("ESP8266_SmartConfig");
 }
 
 // 初始化Web服务器 / Initialize web server
 void setupWebServer() {
   server.on("/", handleRoot);
   server.on("/motor/on", handleMotorOn);
   server.on("/motor/off", handleMotorOff);
   server.on("/motor/direction", handleMotorDirection);
   server.on("/api/motor", handleMotorAPI); // 添加API接口处理 / Add API endpoint handling
   server.on("/api/register", handleRegisterController); // 添加注册控制端的API接口 / Add API endpoint for registering controllers
   server.on("/api/version", handleVersionInfo); // 添加获取版本信息的API接口 / Add API endpoint for getting version information
   server.on("/ota", handleOTA); // 添加OTA升级接口 / Add OTA upgrade endpoint
   server.on("/ota/upload", HTTP_POST, []() {}, handleOTAUpload); // OTA文件上传 / OTA file upload
   server.on("/ota/remote", HTTP_POST, handleOTARemote); // 远程OTA升级 / Remote OTA upgrade
   server.on("/api/mqtt_control", handleToggleMQTTControl); // 添加MQTT控制开关接口 / Add MQTT control toggle endpoint
   server.on("/api/device_info", handleDeviceInfo); // 设备信息接口 / Device info API
   server.on("/api/set_motor_duration", handleSetMotorRunDuration); // 添加设置电机启动时长接口 / Add motor run duration API
   server.on("/api/set_mqtt", handleSetMQTTAddress); // 修复未注册的接口 / Fix unregistered endpoint
   server.on("/clients", handleClientsPage); // 控制端信息页面 / Client info page
   server.on("/api/set_client_name", handleSetClientName); // 设置控制端名称接口 / Set client name API
   server.on("/api/reset_wifi", handleResetWiFi); // 新增重新配网接口 / Add reset WiFi API
   server.begin();
   Serial.println("Web服务器已启动 / Web server started");
 }
 
