1314mjf521/ESP8266/ESP8266/src/main.cpp
 // 初始化函数 / Initialization function
 void setup() {
   Serial.begin(115200); // 调试串口 / Debug serial
 
   // 打印版本信息 / Print version information
   Serial.println("ESP8266 步进电机远程控制系统 / ESP8266 Stepper Motor Remote Control System");
   Serial.println("固件版本: " FIRMWARE_VERSION " / Firmware Version: " FIRMWARE_VERSION);
 
   pinMode(DIR_PIN, OUTPUT);
   pinMode(STEP_PIN, OUTPUT);
   pinMode(ENABLE_PIN, OUTPUT);
   digitalWrite(ENABLE_PIN, HIGH); // 默认关闭电机 / Default to motor off
 
   // 初始化物理按钮引脚 / Initialize physical button pins
   pinMode(MOTOR_BUTTON_PIN, INPUT_PULLUP); // 初始化电机按钮引脚 / Initialize motor button pin
   Serial.println("电机按钮初始化完成 / Motor button initialized");
 
   pinMode(BUTTON_DIRECTION_PIN, INPUT_PULLUP); // 使用内部上拉电阻 / Use internal pull-up resistor
   Serial.println("物理按钮初始化完成 / Physical buttons initialized");
 
   // 初始化WiFi连接 / Initialize WiFi connection
   initializeWiFi();
 
   // 加载保存的MQTT地址
   loadMQTTAddress(); // 加载保存的MQTT地址
   client.setServer(mqtt_server, 1883); // 设置MQTT服务器地址
 
   // 初始化MQTT / Initialize MQTT
   client.setCallback(mqttCallback); // 设置MQTT回调函数 / Set MQTT callback function
 
   // 初始化Web服务器 / Initialize web server
   setupWebServer();
 
   // 初始化OTA / Initialize OTA
   ArduinoOTA.onStart([]() {
     String type = ArduinoOTA.getCommand() == U_FLASH ? "sketch" : "filesystem";
     Serial.println("开始OTA更新: " + type + " / Starting OTA update: " + type);
   });
   ArduinoOTA.onEnd([]() {
     Serial.println("\nOTA更新完成 / OTA update completed");
   });
   ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
     // 修复格式化字符串问题 / Fix format string issue
     Serial.printf("OTA更新进度: %u%%\r / OTA update progress: %u%%\r", progress * 100 / total, progress * 100 / total);
   });
   ArduinoOTA.onError([](ota_error_t error) {
     // 修复格式化字符串问题 / Fix format string issue
     Serial.printf("OTA更新错误[%u]: / OTA update error [%u]: ", static_cast<unsigned int>(error), static_cast<unsigned int>(error));
     if (error == OTA_AUTH_ERROR) {
       Serial.println("认证失败 / Authentication failed");
     } else if (error == OTA_BEGIN_ERROR) {
       Serial.println("开始失败 / Begin failed");
     } else if (error == OTA_CONNECT_ERROR) {
       Serial.println("连接失败 / Connection failed");
     } else if (error == OTA_RECEIVE_ERROR) {
       Serial.println("接收失败 / Receive failed");
     } else if (error == OTA_END_ERROR) {
       Serial.println("结束失败 / End failed");
     }
   }); // 修复结束符号 / Fix closing brace
   ArduinoOTA.begin();
   Serial.println("OTA功能已启动 / OTA functionality started");
 }
 
 // 主循环 / Main loop
 void loop() {
   handleMotorButton(); // 处理电机按钮逻辑 / Handle motor button logic
   handleMotorRunDuration(); // 处理电机运行时长逻辑 / Handle motor run duration logic
   checkMotorInactivity(); // 检查电机未使用超时 / Check motor inactivity timeout
 
   // 检查物理按钮状态 / Check physical button states
   handlePhysicalButtons();
 
   // 检查MQTT连接状态，仅在启用时检测 / Check MQTT connection status only when enabled
   if (mqttControlEnabled) {
     if (!client.connected()) {
       reconnectMQTT(); // 尝试重新连接MQTT / Attempt to reconnect to MQTT
     }
     client.loop(); // 处理MQTT消息 / Handle MQTT messages
   } else {
     // 如果禁用MQTT控制，确保不会尝试连接或处理消息 / Ensure no connection or message handling when disabled
     static bool mqttDisabledLogged = false;
     if (!mqttDisabledLogged) {
       Serial.println("MQTT控制已禁用，跳过MQTT检测 / MQTT control disabled, skipping MQTT checks");
       mqttDisabledLogged = true;
     }
   }
 
   server.handleClient(); // 处理网页请求 / Handle web requests
   ArduinoOTA.handle(); // 处理OTA更新 / Handle OTA updates
 }
 
 // 处理物理按钮逻辑 / Handle physical button logic
 void handlePhysicalButtons() {
   // 读取电机方向按钮状态 / Read motor direction button state
   bool currentDirectionButtonState = digitalRead(BUTTON_DIRECTION_PIN);
   if (currentDirectionButtonState != lastDirectionButtonState) {
     if (currentDirectionButtonState == LOW) { // 按钮被按下 / Button pressed
       motorDirection = !motorDirection; // 切换电机方向 / Toggle motor direction
       digitalWrite(DIR_PIN, motorDirection ? HIGH : LOW); // 控制电机方向引脚 / Control motor direction pin
       Serial.printf("[%lu] 电机方向已切换为: %s（通过按钮） / Motor direction toggled to: %s (via button)\n", millis(), motorDirection ? "正转 / Forward" : "反转 / Reverse", motorDirection ? "正转 / Forward" : "反转 / Reverse");
     }
     lastDebounceTime = millis(); // 更新防抖时间戳 / Update debounce timestamp
   }
   lastDirectionButtonState = currentDirectionButtonState;
 }
 
 // 处理电机启动逻辑 / Handle motor start logic
 void startMotor() {
   if (motorEnabled) {
     motorStartTime = millis(); // 记录启动时间 / Record start time
     digitalWrite(ENABLE_PIN, LOW); // 启动电机 / Enable motor
     Serial.printf("[%lu] 电机启动 / Motor started\n", getTimestamp());
   }
 }
 
 // 处理电机按钮逻辑 / Handle motor button logic
 void handleMotorButton() {
   // 读取按钮状态 / Read button state
   bool currentMotorButtonState = digitalRead(MOTOR_BUTTON_PIN);
 
   // 检测按钮状态变化并处理防抖 / Detect button state change and handle debounce
   if (currentMotorButtonState != lastMotorButtonState) {
     lastMotorButtonDebounceTime = millis(); // 更新防抖时间戳 / Update debounce timestamp
   }
 
   // 如果按钮状态稳定超过防抖延迟 / If button state is stable beyond debounce delay
   if ((millis() - lastMotorButtonDebounceTime) > motorButtonDebounceDelay) {
     // 如果按钮被按下 / If button is pressed
     if (currentMotorButtonState == LOW) {
       updateMotorActivity(); // 更新电机活动时间戳 / Update motor activity timestamp
       if (motorEnabled) {
         // 如果电机已开启，停止电机 / If motor is enabled, stop the motor
         motorEnabled = false;
         digitalWrite(ENABLE_PIN, HIGH); // 禁用电机 / Disable motor
         Serial.printf("[%lu] 电机已关闭（通过按钮） / Motor disabled (via button)\n", millis());
       } else {
         // 如果电机关闭，启动电机 / If motor is disabled, enable the motor
         motorEnabled = true;
         motorStartTime = millis(); // 记录启动时间 / Record start time
         digitalWrite(ENABLE_PIN, LOW); // 启动电机 / Enable motor
         Serial.printf("[%lu] 电机已开启（通过按钮） / Motor enabled (via button)\n", millis());
       }
     }
   }
 
