1314mjf521/ESP8266/ESP8266/src/main.cpp
   // 更新按钮状态 / Update button state
   lastMotorButtonState = currentMotorButtonState;
 
   // 如果电机开启且达到限位，停止电机 / Stop motor if enabled and limit is reached
   if (motorEnabled && currentMotorButtonState == LOW) {
     motorEnabled = false;
     digitalWrite(ENABLE_PIN, HIGH); // 禁用电机 / Disable motor
     Serial.printf("[%lu] 限位触发，电机已停止 / Limit reached, motor stopped\n", getTimestamp());
   }
 }
 
 // 处理电机运行时长逻辑 / Handle motor run duration logic
 void handleMotorRunDuration() {
   if (motorEnabled && (millis() - motorStartTime >= motorRunDuration)) {
     motorEnabled = false;
     digitalWrite(ENABLE_PIN, HIGH); // 停止电机 / Disable motor
     Serial.printf("[%lu] 电机运行时间到，已停止 / Motor run duration elapsed, stopped\n", millis());
   }
 }
 
 // MQTT消息回调函数 / MQTT message callback function
 void mqttCallback(char* topic, byte* payload, unsigned int length) {
   if (!mqttControlEnabled) {
     Serial.printf("[%lu] MQTT控制已禁用，忽略消息 / MQTT control disabled, ignoring message\n", millis());
     return;
   }
 
   // 将MQTT消息转换为字符串 / Convert MQTT message to string
   String message;
   for (unsigned int i = 0; i < length; i++) {
     message += (char)payload[i];
   }
   Serial.printf("[%lu] 收到MQTT消息，主题: %s，内容: %s / Received MQTT message, topic: %s, content: %s\n", millis(), topic, message.c_str(), topic, message.c_str());
 
   // 根据主题处理消息 / Handle message based on topic
   if (String(topic) == mqtt_topic_motor_control) {
     handleMQTTMotorControl(message);
   } else {
     Serial.printf("[%lu] 未知的MQTT主题: %s / Unknown MQTT topic: %s\n", millis(), topic, topic);
   }
 }
 
 // 处理MQTT消息：电机控制 / Handle MQTT message: motor control
 void handleMQTTMotorControl(String message) {
   Serial.printf("[%lu] 处理MQTT电机控制消息: %s / Handling MQTT motor control message: %s\n", millis(), message.c_str(), message.c_str());
   updateMotorActivity(); // 更新电机活动时间戳 / Update motor activity timestamp
   if (message == "on") {
     motorEnabled = true;
     digitalWrite(ENABLE_PIN, LOW); // 使能电机 / Enable motor
     client.publish(mqtt_topic_status_report, "Motor On"); // 上报状态 / Report status
     Serial.printf("[%lu] 电机已开启（通过MQTT） / Motor enabled (via MQTT)\n", millis());
   } else if (message == "off") {
     motorEnabled = false;
     digitalWrite(ENABLE_PIN, HIGH); // 禁用电机 / Disable motor
     client.publish(mqtt_topic_status_report, "Motor Off"); // 上报状态 / Report status
     Serial.printf("[%lu] 电机已关闭（通过MQTT） / Motor disabled (via MQTT)\n", millis());
   } else if (message == "forward") {
     motorDirection = true;
     digitalWrite(DIR_PIN, HIGH); // 设置为正转 / Set to forward
     client.publish(mqtt_topic_status_report, "Motor Forward"); // 上报状态 / Report status
     Serial.printf("[%lu] 电机正转（通过MQTT） / Motor forward (via MQTT)\n", millis());
   } else if (message == "reverse") {
     motorDirection = false;
     digitalWrite(DIR_PIN, LOW); // 设置为反转 / Set to reverse
     client.publish(mqtt_topic_status_report, "Motor Reverse"); // 上报状态 / Report status
     Serial.printf("[%lu] 电机反转（通过MQTT） / Motor reverse (via MQTT)\n", millis());
   } else {
     Serial.printf("[%lu] 未知的电机控制命令（通过MQTT）: %s / Unknown motor control command (via MQTT): %s\n", millis(), message.c_str(), message.c_str());
   }
 }
 
 // 处理Web请求：主页 / Handle web request: root
 void handleRoot() {
   server.send(200, "text/html", MAIN_HTML);
 }
 
 // 处理Web请求：开启电机 / Handle web request: motor on
 void handleMotorOn() {
   if (!motorEnabled) {
     motorEnabled = true;
     motorStartTime = millis(); // 记录启动时间 / Record start time
     digitalWrite(ENABLE_PIN, LOW); // 启动电机 / Enable motor
     updateMotorActivity(); // 更新电机活动时间戳 / Update motor activity timestamp
     Serial.printf("[%lu] 电机已开启（通过网页） / Motor enabled (via web)\n", millis());
   }
   server.sendHeader("Content-Type", "text/plain; charset=utf-8");
   server.send(200, "text/plain", "电机已开启 / Motor enabled");
 }
 
 // 处理Web请求：关闭电机 / Handle web request: motor off
 void handleMotorOff() {
   if (motorEnabled) {
     motorEnabled = false;
     digitalWrite(ENABLE_PIN, HIGH); // 禁用电机 / Disable motor
     Serial.printf("[%lu] 电机已关闭（通过网页） / Motor disabled (via web)\n", millis());
   }
   server.sendHeader("Content-Type", "text/plain; charset=utf-8");
   server.send(200, "text/plain", "电机已关闭 / Motor disabled");
 }
 
 // 处理Web请求：切换电机方向 / Handle web request: toggle motor direction
 void handleMotorDirection() {
   motorDirection = !motorDirection;
   digitalWrite(DIR_PIN, motorDirection ? HIGH : LOW); // 设置电机方向 / Set motor direction
   Serial.printf("[%lu] 电机方向已切换为: %s（通过网页） / Motor direction toggled to: %s (via web)\n", millis(), motorDirection ? "正转 / Forward" : "反转 / Reverse", motorDirection ? "正转 / Forward" : "反转 / Reverse");
   server.sendHeader("Content-Type", "text/plain; charset=utf-8");
   server.send(200, "text/plain", motorDirection ? "电机正转 / Motor forward" : "电机反转 / Motor reverse");
 }
 
 // 处理API请求：电机控制 / Handle API request: motor control
 void handleMotorAPI() {
   if (server.hasArg("command")) {
     String command = server.arg("command");
     Serial.printf("[%lu] 收到API请求，命令: %s / Received API request, command: %s\n", getTimestamp(), command.c_str(), command.c_str());
     updateMotorActivity(); // 更新电机活动时间戳 / Update motor activity timestamp
     if (command == "on") {
       motorEnabled = true;
       digitalWrite(ENABLE_PIN, LOW); // 使能电机 / Enable motor
       server.send(200, "text/plain", "电机已开启 / Motor enabled");
       Serial.printf("[%lu] 电机已开启（通过API） / Motor enabled (via API)\n", getTimestamp());
     } else if (command == "off") {
       motorEnabled = false;
       digitalWrite(ENABLE_PIN, HIGH); // 禁用电机 / Disable motor
       server.send(200, "text/plain", "电机已关闭 / Motor disabled");
       Serial.printf("[%lu] 电机已关闭（通过API） / Motor disabled (via API)\n", getTimestamp());
     } else if (command == "forward") {
       motorDirection = true;
       digitalWrite(DIR_PIN, HIGH); // 设置为正转 / Set to forward
       server.send(200, "text/plain", "电机正转 / Motor forward");
       Serial.printf("[%lu] 电机正转（通过API） / Motor forward (via API)\n", getTimestamp());
     } else if (command == "reverse") {
       motorDirection = false;
       digitalWrite(DIR_PIN, LOW); // 设置为反转 / Set to reverse
       server.send(200, "text/plain", "电机反转 / Motor reverse");
       Serial.printf("[%lu] 电机反转（通过API） / Motor reverse (via API)\n", getTimestamp());
     } else {
       server.send(400, "text/plain", "未知命令 / Unknown command");
       Serial.printf("[%lu] 收到未知命令（通过API） / Unknown command received (via API)\n", getTimestamp());
     }
   } else {
     server.send(400, "text/plain", "缺少命令参数 / Missing command parameter");
     Serial.printf("[%lu] API请求缺少命令参数 / API request missing command parameter\n", getTimestamp());
   }
 }
 
 // 处理Web请求：获取版本信息 / Handle web request: get version information
 void handleVersionInfo() {
   String versionInfo = String("固件版本: ") + FIRMWARE_VERSION + " / Firmware Version: " + FIRMWARE_VERSION;
   server.send(200, "text/plain", versionInfo);
 }
 
 // 处理OTA升级界面 / Handle OTA upgrade page
 void handleOTA() {
   String html = R"rawliteral(
     <!DOCTYPE html>
     <html>
     <head>
       <meta charset="UTF-8">
       <title>OTA 升级</title>
       <style>
         body { font-family: Arial, sans-serif; text-align: center; margin: 20px; }
         h1 { color: #333; }
         p { font-size: 16px; }
         input[type="file"], button, input[type="text"] { padding: 10px; margin: 10px; font-size: 16px; }
         button { background-color: #4CAF50; color: white; border: none; cursor: pointer; }
         button:hover { background-color: #45a049; }
         input[type="text"] { width: 300px; }
       </style>
     </head>
     <body>
       <h1>OTA 升级</h1>
       <p>通过以下方式上传固件文件或指定远程地址进行升级。</p>
       <h2>上传固件文件</h2>
       <form method="POST" action="/ota/upload" enctype="multipart/form-data">
         <input type="file" name="firmware">
         <button type="submit">上传并升级</button>
       </form>
       <h2>远程升级</h2>
       <form method="POST" action="/ota/remote">
         <input type="text" name="url" placeholder="输入远程固件地址" required>
         <button type="submit">开始远程升级</button>
       </form>
       <button onclick="location.href='/'">返回主页面</button>
     </body>
     </html>
   )rawliteral";
 
   server.send(200, "text/html", html);
 }
 
 // 处理OTA文件上传 / Handle OTA file upload
 void handleOTAUpload() {
   HTTPUpload& upload = server.upload();
   if (upload.status == UPLOAD_FILE_START) {
     Serial.printf("开始上传固件: %s\n", upload.filename.c_str());
     size_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000; // 获取最大可用空间 / Get maximum available space
     if (!Update.begin(maxSketchSpace)) { // 初始化OTA更新 / Initialize OTA update
       Serial.printf("OTA初始化失败，错误代码: %d\n", Update.getError()); // 输出错误代码 / Print error code
       server.send(200, "text/html", R"rawliteral(
         <!DOCTYPE html>
         <html>
         <head>
           <meta charset="UTF-8">
           <script>
             alert('OTA初始化失败 / OTA initialization failed');
             window.location.href = '/ota';
           </script>
         </head>
         <body></body>
         </html>
       )rawliteral");
       return;
     }
   } else if (upload.status == UPLOAD_FILE_WRITE) {
     if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
       Serial.printf("OTA写入失败，错误代码: %d\n", Update.getError()); // 输出错误代码 / Print error code
       server.send(200, "text/html", R"rawliteral(
         <!DOCTYPE html>
         <html>
         <head>
           <meta charset="UTF-8">
           <script>
             alert('OTA写入失败 / OTA write failed');
             window.location.href = '/ota';
           </script>
         </head>
         <body></body>
         </html>
       )rawliteral");
       return;
     }
   } else if (upload.status == UPLOAD_FILE_END) {
     if (Update.end(true)) { // 完成OTA更新 / Finish OTA update
       Serial.println("OTA更新成功 / OTA update successful");
       server.send(200, "text/html", R"rawliteral(
         <!DOCTYPE html>
         <html>
         <head>
           <meta charset="UTF-8">
           <script>
             alert('OTA更新成功，设备即将重启 / OTA update successful, device will restart');
             window.location.href = '/';
           </script>
         </head>
         <body></body>
         </html>
       )rawliteral");
       ESP.restart(); // 重启设备 / Restart device
     } else {
       Serial.printf("OTA更新失败，错误代码: %d\n", Update.getError()); // 输出错误代码 / Print error code
       server.send(200, "text/html", R"rawliteral(
         <!DOCTYPE html>
         <html>
         <head>
           <meta charset="UTF-8">
           <script>
             alert('OTA更新失败 / OTA update failed');
             window.location.href = '/ota';
           </script>
         </head>
         <body></body>
         </html>
       )rawliteral");
     }
   }
 }
 
 // 处理远程OTA升级 / Handle remote OTA upgrade
 void handleOTARemote() {
   if (server.hasArg("url")) {
     String url = server.arg("url");
     Serial.printf("开始远程OTA升级，地址: %s\n", url.c_str());
     WiFiClient client;
     HTTPClient http;
 
     if (http.begin(client, url)) { // 开始下载固件 / Start downloading firmware
       int httpCode = http.GET();
       if (httpCode == HTTP_CODE_OK) {
         size_t contentLength = static_cast<size_t>(http.getSize());
         if (contentLength > 0) {
           if (Update.begin(contentLength)) { // 初始化OTA更新 / Initialize OTA update
             WiFiClient* stream = http.getStreamPtr();
             size_t written = Update.writeStream(*stream);
             if (written == contentLength && Update.end()) {
               Serial.println("远程OTA更新成功 / Remote OTA update successful");
               server.send(200, "text/html", R"rawliteral(
                 <!DOCTYPE html>
                 <html>
                 <head>
                   <meta charset="UTF-8">
                   <script>
                     alert('远程OTA更新成功，设备即将重启 / Remote OTA update successful, device will restart');
                     window.location.href = '/';
                   </script>
                 </head>
                 <body></body>
                 </html>
               )rawliteral");
               ESP.restart(); // 重启设备 / Restart device
             } else {
               Serial.printf("远程OTA更新失败，错误代码: %d\n", Update.getError());
               server.send(200, "text/html", R"rawliteral(
                 <!DOCTYPE html>
                 <html>
                 <head>
                   <meta charset="UTF-8">
                   <script>
                     alert('远程OTA更新失败 / Remote OTA update failed');
                     window.location.href = '/ota';
                   </script>
                 </head>
                 <body></body>
                 </html>
               )rawliteral");
             }
           } else {
             Serial.printf("OTA初始化失败，错误代码: %d\n", Update.getError());
             server.send(200, "text/html", R"rawliteral(
               <!DOCTYPE html>
               <html>
               <head>
                 <meta charset="UTF-8">
                 <script>
                   alert('OTA初始化失败 / OTA initialization failed');
                   window.location.href = '/ota';
                 </script>
               </head>
               <body></body>
               </html>
             )rawliteral");
           }
         } else {
           Serial.println("远程固件大小无效 / Invalid firmware size");
           server.send(200, "text/html", R"rawliteral(
             <!DOCTYPE html>
             <html>
             <head>
               <meta charset="UTF-8">
               <script>
                 alert('远程固件大小无效 / Invalid firmware size');
                 window.location.href = '/ota';
               </script>
             </head>
             <body></body>
             </html>
           )rawliteral");
         }
       } else {
         Serial.printf("HTTP请求失败，状态码: %d\n", httpCode);
         server.send(200, "text/html", R"rawliteral(
           <!DOCTYPE html>
           <html>
           <head>
             <meta charset="UTF-8">
             <script>
               alert('HTTP请求失败 / HTTP request failed');
               window.location.href = '/ota';
             </script>
           </head>
           <body></body>
           </html>
         )rawliteral");
       }
       http.end();
     } else {
       Serial.println("无法连接到远程地址 / Unable to connect to remote URL");
       server.send(200, "text/html", R"rawliteral(
         <!DOCTYPE html>
         <html>
         <head>
           <meta charset="UTF-8">
           <script>
             alert('无法连接到远程地址 / Unable to connect to remote URL');
             window.location.href = '/ota';
           </script>
         </head>
         <body></body>
         </html>
       )rawliteral");
     }
   } else {
     server.send(200, "text/html", R"rawliteral(
       <!DOCTYPE html>
       <html>
       <head>
         <meta charset="UTF-8">
         <script>
           alert('缺少远程地址参数 / Missing remote URL parameter');
           window.location.href = '/ota';
       </script>
       </head>
       <body></body>
       </html>
     )rawliteral");
   }
 }
 
